<template>
  <h1>Об этом проекте</h1>
  <p>
    Данное приложение было сделано в рамках практики работы с фреймворком Vue3
  </p>
  <p><strong>Функционал приложения:</strong></p>
  <ul>
    <li>Приложение написано на Vue3</li>
    <li>Реализован поиск по заголовку постов</li>
    <li>Реализована сортировка постов</li>
    <li>Реализована анимация списка</li>
    <li>
      Реализована подгрузка списка постов через 'fake-api' с помощью библиотеки
      axios
    </li>
    <li>Реализована динамическая подгрузка постов при скролле</li>
    <li>Реализована возможность добавления поста</li>
    <li>Реализована возможность просмотра поста</li>
    <li>Реализован роутинг приложения</li>
    <li>Реализована базовая адаптивность приложения</li>
    <li>Реализована страница постов на классическом CLI-макете</li>
    <li>Реализована страница постов c использованием стора Vuex</li>
    <li>Реализована страница с архитектурой построенной на Composition Api</li>
  </ul>
  <p>
    <strong>P.S.</strong> Стилизация данного приложения не в ходила в основную
    задумку, главное
    <a href="https://github.com/ARTALEAL/vue-posts" target="_blank"
      >тут код и структура проекта</a
    >
  </p>
</template>

<script>
export default {};
</script>

<style scoped>
h1 {
  margin-bottom: 50px;
}
ul {
  margin-left: 25px;
}
li {
  font-size: 1.5rem;
}
a {
  color: black;
}
@media (width < 768px) {
  li {
    font-size: 1rem;
  }
}
</style>
